#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/eggs-projects/infra/runs/run-KeyCgKADGBxiiAb9

Waiting for the plan to start...

Terraform v1.1.8
on linux_amd64
Initializing plugins and modules...
tfe_workspace.projects["blog"]: Refreshing state... [id=ws-yF7cX2wrjPJLKDwz]
github_actions_secret.tf_api_token["blog"]: Refreshing state... [id=blog:TF_API_TOKEN]
github_repository.projects["blog"]: Refreshing state... [id=blog]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_access_key.projects["ghost-blog"] will be created
  + resource "aws_iam_access_key" "projects" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eggs-projects-ghost-blog-user"
    }

  # aws_iam_access_key.projects["test-repo"] will be created
  + resource "aws_iam_access_key" "projects" {
      + create_date                    = (known after apply)
      + encrypted_secret               = (known after apply)
      + encrypted_ses_smtp_password_v4 = (known after apply)
      + id                             = (known after apply)
      + key_fingerprint                = (known after apply)
      + secret                         = (sensitive value)
      + ses_smtp_password_v4           = (sensitive value)
      + status                         = "Active"
      + user                           = "eggs-projects-test-repo-user"
    }

  # aws_iam_role.projects["ghost-blog"] will be created
  + resource "aws_iam_role" "projects" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::470292911211:user/ghost-blog-user"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eggs-projects-ghost-blog-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "eggs-projects-ghost-blog-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ec2:Describe*",
                            ]
                          + Effect   = "Allow"
                          + Resource = "eggs-projects-ghost-blog*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_iam_role.projects["test-repo"] will be created
  + resource "aws_iam_role" "projects" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::470292911211:user/test-repo-user"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eggs-projects-test-repo-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "eggs-projects-test-repo-policy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "ec2:Describe*",
                            ]
                          + Effect   = "Allow"
                          + Resource = "eggs-projects-test-repo*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # aws_iam_user.projects["ghost-blog"] will be created
  + resource "aws_iam_user" "projects" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eggs-projects-ghost-blog-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user.projects["test-repo"] will be created
  + resource "aws_iam_user" "projects" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "eggs-projects-test-repo-user"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # github_actions_secret.tf_api_token["blog"] will be destroyed
  # (because key ["blog"] is not in for_each map)
  - resource "github_actions_secret" "tf_api_token" {
      - created_at      = "2022-11-19 22:03:45 +0000 UTC" -> null
      - encrypted_value = (sensitive value)
      - id              = "blog:TF_API_TOKEN" -> null
      - plaintext_value = (sensitive value)
      - repository      = "blog" -> null
      - secret_name     = "TF_API_TOKEN" -> null
      - updated_at      = "2022-11-19 22:03:45 +0000 UTC" -> null
    }

  # github_actions_secret.tf_api_token["ghost-blog"] will be created
  + resource "github_actions_secret" "tf_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "ghost-blog"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.tf_api_token["test-repo"] will be created
  + resource "github_actions_secret" "tf_api_token" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "test-repo"
      + secret_name     = "TF_API_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_repository.projects["blog"] will be destroyed
  # (because key ["blog"] is not in for_each map)
  - resource "github_repository" "projects" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Blog to track projects, gaming, opinions, etc..." -> null
      - etag                        = "W/\"af164c7a2752b63a68f22db56e7bd375c1b63a53c6d970f2e2287ed396ea8846\"" -> null
      - full_name                   = "michaeldeggers/blog" -> null
      - git_clone_url               = "git://github.com/michaeldeggers/blog.git" -> null
      - has_downloads               = false -> null
      - has_issues                  = false -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/michaeldeggers/blog" -> null
      - http_clone_url              = "https://github.com/michaeldeggers/blog.git" -> null
      - id                          = "blog" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "blog" -> null
      - node_id                     = "R_kgDOId6VYQ" -> null
      - private                     = false -> null
      - repo_id                     = 568235361 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:michaeldeggers/blog.git" -> null
      - svn_url                     = "https://github.com/michaeldeggers/blog" -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null

      - template {
          - include_all_branches = false -> null
          - owner                = "michaeldeggers" -> null
          - repository           = "repo_template" -> null
        }
    }

  # github_repository.projects["ghost-blog"] will be created
  + resource "github_repository" "projects" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Blog to track projects, gaming, opinions, etc..."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "ghost-blog"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"

      + template {
          + include_all_branches = false
          + owner                = "michaeldeggers"
          + repository           = "repo_template"
        }
    }

  # github_repository.projects["test-repo"] will be created
  + resource "github_repository" "projects" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Test Repo"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "test-repo"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "private"

      + template {
          + include_all_branches = false
          + owner                = "michaeldeggers"
          + repository           = "repo_template"
        }
    }

  # tfe_variable.access_key["ghost-blog"] will be created
  + resource "tfe_variable" "access_key" {
      + category     = "env"
      + description  = "AWS Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.access_key["test-repo"] will be created
  + resource "tfe_variable" "access_key" {
      + category     = "env"
      + description  = "AWS Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.aws_account_id["ghost-blog"] will be created
  + resource "tfe_variable" "aws_account_id" {
      + category     = "terraform"
      + description  = "Project Name"
      + hcl          = false
      + id           = (known after apply)
      + key          = "aws_account_id"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.aws_account_id["test-repo"] will be created
  + resource "tfe_variable" "aws_account_id" {
      + category     = "terraform"
      + description  = "Project Name"
      + hcl          = false
      + id           = (known after apply)
      + key          = "aws_account_id"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.project_name["ghost-blog"] will be created
  + resource "tfe_variable" "project_name" {
      + category     = "terraform"
      + description  = "Project Name"
      + hcl          = false
      + id           = (known after apply)
      + key          = "project_name"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.project_name["test-repo"] will be created
  + resource "tfe_variable" "project_name" {
      + category     = "terraform"
      + description  = "Project Name"
      + hcl          = false
      + id           = (known after apply)
      + key          = "project_name"
      + sensitive    = false
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.secret_key["ghost-blog"] will be created
  + resource "tfe_variable" "secret_key" {
      + category     = "env"
      + description  = "AWS Secret Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_variable.secret_key["test-repo"] will be created
  + resource "tfe_variable" "secret_key" {
      + category     = "env"
      + description  = "AWS Secret Access Key"
      + hcl          = false
      + id           = (known after apply)
      + key          = "AWS_SECRET_ACCESS_KEY"
      + sensitive    = true
      + value        = (sensitive value)
      + workspace_id = (known after apply)
    }

  # tfe_workspace.projects["blog"] will be destroyed
  # (because key ["blog"] is not in for_each map)
  - resource "tfe_workspace" "projects" {
      - allow_destroy_plan            = true -> null
      - assessments_enabled           = false -> null
      - auto_apply                    = false -> null
      - execution_mode                = "remote" -> null
      - file_triggers_enabled         = true -> null
      - force_delete                  = false -> null
      - global_remote_state           = false -> null
      - id                            = "ws-yF7cX2wrjPJLKDwz" -> null
      - name                          = "eggs-projects-blog" -> null
      - operations                    = true -> null
      - organization                  = "eggs-projects" -> null
      - queue_all_runs                = true -> null
      - remote_state_consumer_ids     = [] -> null
      - speculative_enabled           = true -> null
      - structured_run_output_enabled = true -> null
      - tag_names                     = [
          - "project",
        ] -> null
      - terraform_version             = "1.3.5" -> null
      - trigger_patterns              = [] -> null
      - trigger_prefixes              = [] -> null
    }

  # tfe_workspace.projects["ghost-blog"] will be created
  + resource "tfe_workspace" "projects" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "eggs-projects-ghost-blog"
      + operations                    = (known after apply)
      + organization                  = "eggs-projects"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "project",
        ]
      + terraform_version             = (known after apply)
    }

  # tfe_workspace.projects["test-repo"] will be created
  + resource "tfe_workspace" "projects" {
      + allow_destroy_plan            = true
      + auto_apply                    = false
      + execution_mode                = "remote"
      + file_triggers_enabled         = true
      + force_delete                  = false
      + global_remote_state           = (known after apply)
      + id                            = (known after apply)
      + name                          = "eggs-projects-test-repo"
      + operations                    = (known after apply)
      + organization                  = "eggs-projects"
      + queue_all_runs                = true
      + remote_state_consumer_ids     = (known after apply)
      + speculative_enabled           = true
      + structured_run_output_enabled = true
      + tag_names                     = [
          + "demo",
        ]
      + terraform_version             = (known after apply)
    }

Plan: 20 to add, 0 to change, 3 to destroy.


```

</details>

*Pushed by: @michaeldeggers, Action: `pull_request`*